[
    {
        "name": "Techniques",
        "desc": "Elements of a software development process, such as experience design; and ways of structuring software, such micro-services.",
        "layers": [
            {
                "name": "Adopt",
                "data": [
                    {
                        "name": "Mobile testing on mobile networks",
                        "active": true, 
                        "desc": "N/A", 
                        "analysis": "We increasingly see mobile applications that work really well during development and testing, but run into trouble when they are deployed in the real world. Mobile testing on  mobile  networks reveals how your app performs under a variety of conditions. You might test using 3G or LTE or deliberately use a poor WiFi network with overloaded access points. Measure network performance for your target environment, then simulate the conditions using latency and packet-loss inducing tools. In addition, it is sometimes necessary to examine exactly how your device and software are using the network with a tool such as Wireshark."
                    },                    
                    {
                        "name": "Performance testing as a first-class citizen",
                        "active": true, 
                        "desc": "Performance testing is in general testing performed to determine how a system performs in terms of responsiveness and stability under a particular workload. It can also serve to investigate, measure, validate or verify other quality attributes of the system, such as scalability, reliability and resource usage.", 
                        "analysis": "While unit and acceptance testing are widely embraced as standard development practices, this trend has not continued into the realm of performance testing. Currently, the common tooling drives testers towards creating throw away code and a click and script mentality. Treating performance    testing as  a   first-class citizen enables the creation of better tests that cover more functionality, leading to better tooling to create and run performance tests, resulting in a test suite that is maintainable and can itself be tested."
                    },                    
                    {
                        "name": "Promises for asynchronous programming",
                        "active": true, 
                        "desc": "In computer science, future, promise, and delay refer to constructs used for synchronizing in some concurrent programming languages. They describe an object that acts as a proxy for a result that is initially unknown, usually because the computation of its value is yet incomplete.", 
                        "analysis": "The use of promises for asynchronous programming is an old technique that is also known as futures. It is gaining renewed interest in light of the extensive use of JavaScript on both the client and server side. This technique eliminates the use of deeply nested callbacks, flags and pollers and has first-class support from libraries such as jQuery. Teams developing JavaScript codebases of significant complexity should take advantage of this."
                    }
                ]
            },
            {
                "name": "Trial",
                "data": [                 
                    {
                        "name": "Blue-green deployment",
                        "active": true, 
                        "desc": "Blue-green deployment is a pattern for performing software upgrades.", 
                        "analysis": "By setting up the latest version of your application on an identical clone of your production application stack, traffic can be switched, near instantaneously, from the current production stack to the new one as soon as the test suite and the business determine it is appropriate. Though this is an old technique, infrastructure automation and resources in the cloud make it worth reconsidering."
                    },                    
                    {
                        "name": "Co-location by telepresence",
                        "active": true, 
                        "desc": "N/A", 
                        "analysis": "Increasing quality and range of choices for inexpensive or free video conferencing is leading to a new way of working for distributed teams. Always-on video connections can help create a sense of co-location by telepresence, even when the team is distributed geographically. This is becoming the defacto standard in some of our offshore delivery centers. We are also seeing increased use of screen-sharing tools like ScreenHero for remote pairing. We would caution those looking for a silver bullet to eliminate the need for physical co-location."
                    },
                    {
                        "name": "Database migrations for NoSQL",
                        "active": true, 
                        "desc": "N/A", 
                        "analysis": "NoSQL data stores continue to become mainstream, and teams should acknowledge the need for database  migrations  for NoSQL. Especially with an implicit or dynamic schema you are likely to want to reconfigure data over time. There are several approaches such as running an explicit migration when deploying a new build of your application, or using dynamic migrations in code as documents are loaded and processed."
                    },
                    {
                        "name": "HTML5 storage instead of cookies",
                        "active": true, 
                        "desc": "HTML5 storage, also known as local storage or web storage, is a mechanism for storing client side data in modern browsers, including iOS and Android mobile browsers.", 
                        "analysis": "We recommend using HTML5 storage instead of  cookies in almost all cases. HTML5 Storage can accommodate up to 5MB of data while cookies are limited to 4KB. Cookie data is transmitted in every request, which slows down your application and potentially exposes data over insecure HTTP connections. In contrast, HTML5 storage data remains securely in the browser. Cookies should be reserved for storing small simple pieces of data like a session ID."
                    }
                ]
            },
            {
                "name": "Assess",
                "data": [
                    {
                        "name": "Capturing client-side JavaScript errors",
                        "active": true, 
                        "desc": "N/A", 
                        "analysis": "NoSQL data stores continue to become mainstream, and teams should acknowledge the need for database  migrations  for NoSQL. Especially with an implicit or dynamic schema you are likely to want to reconfigure data over time. There are several approaches such as running an explicit migration when deploying a new build of your application, or using dynamic migrations in code as documents are loaded and processed."
                    },                 
                    {
                        "name": "Focus on mean time to recovery",
                        "active": true, 
                        "desc": "N/A", 
                        "analysis": "In previous radars we recommended arranging automated acceptance tests into longer journeys and, in what we call semantic monitoring, running these tests continuously against a production environment. We still believe that this is an important technique for scenarios the team can anticipate in advance. A variation of this approach, seen especially with startups, is to reduce the number of tests while increasing monitoring and automatic alarms. This shifts the focus from avoiding problems that can be anticipated to reducing mean time to recovery for all problems."
                    },
                    {
                        "name": "Machine image as a build artifact",
                        "active": true, 
                        "desc": "The idea that complete machine VM's are the output of a build pipeline instead of just executable.", 
                        "analysis": "Most virtualization technologies provide a way to launch a machine from an image. By creating a machine image as a build artifact early in your build pipeline and promoting it through the pipeline as it passes further suites of tests, you can reliably deploy the exact machine that passed the tests into production. This technique eliminates most causes of the snowflake server anti-pattern."
                    },                    
                    {
                        "name": "Minimizing application configuration",
                        "active": true, 
                        "desc": "", 
                        "analysis": ""
                    }
                ]
            },
            {
                "name": "Hold",
                "data": [
                    {
                        "name": "Exhaustive browser based testing",
                        "active": false, 
                        "desc": "N/A", 
                        "analysis": "N/A"
                    }                  
                ]
            }
        ]
    },
    {
        "name": "Platforms",
        "desc": "Things that we build software on top of: mobile technologies like Android, virtual platforms like the JVM, or generic kinds of platforms like hybrid clouds.",
        "layers": [
            {
                "name": "Adopt",
                "data": [
                    {
                        "name": "ElasticSearch",
                        "active": true, 
                        "desc": "Elasticsearch is a search server based on Lucene. It provides a distributed, multitenant-capable full-text search engine with a RESTful web interface and schema-free JSON documents.", 
                        "analysis": "Over the past year we have seen a gradual uptake in the adoption of Elastic Search as an open source search platform. It is an extensible, multi-tenanted, and horizontally scalable search solution based on Apache Lucene. It allows complex data structures to be indexed and retrieved through a JSON based REST API. It provides an elegant model of operation with automatic discovery of peers in a cluster, failover, and replication. Elastic Search can be extended with a plugin system that allows adding new functionality and changing existing behavior. The community around this tool is quite vibrant as illustrated by the number of client libraries available in languages like Java, C#, Ruby, and JavaScript."
                    },                    
                    {
                        "name": "MongoDB",
                        "active": true, 
                        "desc": "MongoDB (from \"humongous\") is a cross-platform document-oriented database system. Classified as a NoSQL database, MongoDB eschews the traditional table-based relational database structure in favor of JSON-like documents with dynamic schemas (MongoDB calls the format BSON), making the integration of data in certain types of applications easier and faster.", 
                        "analysis": "For problems that fit the document database model, MongoDB is now the most popular choice. In addition to ease of use and a solid technical implementation, the community and ecosystem contributed to this success. We are aware of problems where teams were tempted by the popularity of MongoDB when a document database was not a good fit or they did not understand the inherent complexity. When used appropriately, however, MongoDB has proven itself on many projects."
                    },                    
                    {
                        "name": "Neo4J",
                        "active": false, 
                        "desc": "Neo4j is an open-source graph database, implemented in Java. The developers describe Neo4j as \"embedded, disk-based, fully transactional Java persistence engine that stores data structured in graphs rather than in tables\".", 
                        "analysis": ""
                    },                    
                    {
                        "name": "Redis",
                        "active": true, 
                        "desc": "Redis is an open-source, networked, in-memory, key-value data store with optional durability. It is written in ANSI C. The development of Redis has been sponsored by Pivotal since May 2013; until then, it was sponsored by VMWare.", 
                        "analysis": "Redis has proven a useful tool on multiple ThoughtWorks projects, used as both structured cache and data store distributed across multiple countries."
                    },
                    {
                        "name": "SMS and USSD as a UI",
                        "active": true, 
                        "desc": "SMS is a long standing technique for sending messages, and USSD allows you to send SMS like messages in a secure session.", 
                        "analysis": "58% of all phones sold last year globally were feature phones. In many developing countries, this is an even larger majority. If your market requires you to develop for these areas, you need to develop with this constraint in mind. These phones use SMS   and USSD as a user interface.  You should look at USSD and SMS as another UI and UX platform and treat them as first-class citizens."
                    }                
                ]
            },
            {
                "name": "Trial",
                "data": [                  
                    {
                        "name": "Couchbase",
                        "active": false, 
                        "desc": "Couchbase Server, originally known as Membase, is an open source, distributed (shared-nothing architecture) NoSQL document-oriented database that is optimized for interactive applications.", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "Hadoop 2.0",
                        "active": true, 
                        "desc": "The Apache Hadoop software library is a framework that allows for the distributed processing of large data sets across clusters of computers using simple programming models.", 
                        "analysis": "Hadoop initial architecture was based on the paradigm of scaling data horizontally and metadata vertically. While data storage and processing were handled by the slave nodes reasonably well, the masters that managed metadata were a single point of failure and limiting for web scale usage. Hadoop  2.0 has significantly re-architected both HDFS and the Map Reduce framework to address these issues. The HDFS namespace can be federated now using multiple name nodes on the same cluster and deployed in a HA mode. MapReduce has been replaced with YARN, which decouples cluster resource management from job state management and eliminates the scale/performance issues with the JobTracker. Most importantly, this change encourages deploying new distributed programming paradigms in addition to MapReduce on Hadoop clusters."
                    },
                    {
                        "name": "Node.js",
                        "active": true, 
                        "desc": "Node.js is a software platform that is used to build scalable network (especially server-side) applications. Node.js utilizes JavaScript as its scripting language, and achieves high throughput via non-blocking I/O and a single-threaded event loop.", 
                        "analysis": "Node.js is a lightweight web container that is a strong option for development of micro services and as a server to mobile and single-page web applications. Due to the asynchronous nature of node.js, developers are turning to promise libraries to simplify their application code. As the use of promises mature within the node.js community, we expect to see more applications developed for node.js. For those teams that are reluctant to try node.js in production, it is still worthwhile to consider node.js for development tasks like running JavaScript tests outside of the browser or generating static web content from tools like CoffeeScript, SASS, and LESS."
                    },                    
                    {
                        "name": "OpenStack",
                        "active": true, 
                        "desc": "OpenStack is a global collaboration of developers and cloud computing technologists producing the ubiquitous open source cloud computing platform for public and private clouds.", 
                        "analysis": "The open source OpenStack project is gathering steam, and in recent months is becoming a more viable platform for deploying your own private clouds. Many issues which made OpenStack hard to get up and running have been addressed, and new features are being added all the time. It is clear that the OpenStack consortium and its members like Rackspace, Redhat, and HP are committed to the project as the basis for their own OpenStack-based cloud services."
                    },                    
                    {
                        "name": "Rackspace Cloud",
                        "active": true, 
                        "desc": "N/A", 
                        "analysis": "While AWS continues to add more features, Rackspace Cloud has become a viable competition in the storage and compute space. Some users may value the more thorough customer support available for Rackspace, as well as the ability to mix in more traditional hosting models. We are not excited about this just because Rackspace is a client of ours and we have had the pleasure developing the platform. We have successfully used Rackspace Cloud with several other clients, and would look forward to it being offered in more geographical locations."
                    },                    
                    {
                        "name": "Riak",
                        "active": false, 
                        "desc": "Riak is an open-source, fault-tolerant key-value NoSQL database implementing the principles from Amazon's Dynamo paper with heavy influence from Dr. Eric Brewer's CAP Theorem.", 
                        "analysis": "N/A"
                    }                  
                ]
            },
            {
                "name": "Assess",
                "data": [
                    {
                        "name": "Azure",
                        "active": false, 
                        "desc": "Windows Azure is an open and flexible cloud platform that enables you to quickly build, deploy and manage applications across a global network of Microsoft-managed datacenters.", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "Calatrava",
                        "active": false, 
                        "desc": "Calatrava is a cross-platform mobile framework that lets you share the core logic of your application across iOS, Android and Mobile Web, but unlike other XP toolkits it allows you to always write the highest quality native UI you need.", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "Datomic",
                        "active": false, 
                        "desc": "Datomic is a database of flexible, time-based facts, supporting queries and joins, with elastic scalability, and ACID transactions.", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "PhoneGap/Apache Cordova",
                        "active": true, 
                        "desc": "PhoneGap is a free and open source framework that allows you to create mobile apps using standardized web APIs for the platforms you care about.", 
                        "analysis": "PhoneGap, now renamed as Apache Cordova, is a platform that lets you develop cross-platform mobile applications using HTML, CSS and JavaScript. It abstracts away platform specific native code through a set JavaScript APIs that remain consistent across different mobile platforms. Cordova is available for a wide array of platforms including iOS, Android, Blackberry, Windows Phone, and WebOS."
                    },
                    {
                        "name": "PostgreSQL for NoSQL",
                        "active": true, 
                        "desc": "N/A", 
                        "analysis": "PostgreSQL is expanding to become the NoSQL choice of SQL databases. Version 9.2 includes the ability to store JSON data with full querying capabilities on the content of the JSON document. Other extensions let the user store and query data in the form of key/value pairs. This lets you take advantage of the underlying storage and transactional capabilities of a time-tested database without being tied to a relational data model. This is ideal for those who want both SQL and NoSQL applications but prefer a single reliable infrastructure that they already know how to support."
                    },                    
                    {
                        "name": "Vumi",
                        "active": true, 
                        "desc": "Messaging engine for the delivery of SMS, Star Menu and chat messages to diverse audiences in emerging markets and beyond.", 
                        "analysis": "Vumi is a scalable open source messaging engine driving conversations through frugal methods on mobile devices. Vumi facilitates SMS, IM and USSD interactions between companies and their clients, health services and their patients, governments and citzens, and more. Vumi integrates with telcos and allows you to build apps on top of it easily. You only have to pay for carrier charges."
                    },                    
                    {
                        "name": "Zepto.js",
                        "active": true, 
                        "desc": "Zepto is a minimalist JavaScript library for modern browsers with a largely jQuery-compatible API. If you use jQuery, you already know how to use Zepto.", 
                        "analysis": "N/A"
                    }                 
                ]
            },
            {
                "name": "Hold",
                "data": [              
                    {
                        "name": "WS-*",
                        "active": false, 
                        "desc": "Web of Services refers to message-based design frequently found on the Web and in enterprise software. The Web of Services is based on technologies such as HTTP, XML, SOAP, WSDL, SPARQL, and others.", 
                        "analysis": "N/A"
                    }               
                ]
            }
        ]
    },
    {
        "name": "Tools",
        "desc": "Includes things like components, such as databases, software development tools, such as versions control systems; or more generic categories of tools, such as the notion of polyglot persistance.",
        "layers": [
            {
                "name": "Adopt",
                "data": [
                    {
                        "name": "D3",
                        "active": true, 
                        "desc": "D3.js is a JavaScript library for manipulating documents based on data. D3 helps you bring data to life using HTML, SVG and CSS. ", 
                        "analysis": "D3 continues to gain traction as a library for creating rich visualizations in the browser. Previously, it was somewhat low-level, requiring more work for the creation of commonly used visualizations than less sophisticated, more targeted libraries. Since the last radar, libraries like Rickshaw for charting and Crossfilter for in-browser dataset exploration have helped make D3 even more accessible than before."
                    },                    
                    {
                        "name": "Frank",
                        "active": true, 
                        "desc": "Frank is an open source library that allows functional tests for iOS written in Cucumber and executed on a remote device. ", 
                        "analysis": "This fills an important niche where acceptance test-driven development was previously cumbersome and awkward."
                    },                    
                    {
                        "name": "Gradle",
                        "active": true, 
                        "desc": "Gradle is build automation evolved. Gradle can automate the building, testing, publishing, deployment and more of software packages or other types of projects such as generated static websites, generated documentation or indeed anything else.", 
                        "analysis": "Language-based build tools like Gradle and Rake continue to offer finer-grained abstractions and more flexibility long term than XML and plug-in based tools like Ant and Maven. This allows them to grow gracefully as projects become more complex."
                    },
                    {
                        "name": "Graphite",
                        "active": false, 
                        "desc": "Graphite is an enterprise-scale monitoring tool that runs well on cheap hardware. ", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "NuGet",
                        "active": true, 
                        "desc": "NuGet is the package manager for the Microsoft development platform including .NET.", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "PSake",
                        "active": false, 
                        "desc": "psake is a build automation tool written in PowerShell. It avoids the angle-bracket tax associated with executable XML by leveraging the PowerShell syntax in your build scripts.", 
                        "analysis": "N/A"
                    }                  
                ]
            },
            {
                "name": "Trial",
                "data": [
                    {
                        "name": "Apache Pig",
                        "active": false, 
                        "desc": "Apache Pig is a platform for analyzing large data sets that consists of a high-level language for expressing data analysis programs, coupled with infrastructure for evaluating these programs.", 
                        "analysis": ""
                    },                    
                    {
                        "name": "Gatling",
                        "active": true, 
                        "desc": "Gatling is an Open Source Stress Tool with high performances, simple concepts, a DSL to describe scenarios, HTTP support, a scenario recorder and meaningful reports.", 
                        "analysis": "Gatling is another newer player in the automated performance testing space. It is similar to Locust and is much lighter weight than the older options such as JMeter and Grinder. Built on Scala, the DSL provides extensive functionality out of the box including easily configured data feeds and response assertions. In cases where customization is needed, it is easy to drop into Scala to provide extensions. The default generation of numerous dynamic views of the data via Highcharts adds to its appeal."
                    },                    
                    {
                        "name": "PhantomJS",
                        "active": true, 
                        "desc": "PhantomJS is a headless WebKit scriptable with a JavaScript API. It has fast and native support for various web standards: DOM handling, CSS selector, JSON, Canvas, and SVG.", 
                        "analysis": "We see interest on ThoughtWorks projects around PhantomJS, a headless web testing tool that allows functional testing against a realistic target."
                    },                    
                    {
                        "name": "TestFlight & HockeyApp",
                        "active": true, 
                        "desc": "TestFlight and HockeyApp allow you to manage the deployment of mobile applications without an app store, making user testing easier.", 
                        "analysis": "They offer crash reporting and analytic capabilities to gather data in the field. HockeyApp supports IOS, Android, & Windows Phone, while TestFlight supports iOS and Android. We have used both tools successfully to help deliver mobile applications. This is clearly a fast evolving space."
                    }                  
                ]
            },
            {
                "name": "Assess",
                "data": [
                    {
                        "name": "Browser-based templating",
                        "active": true, 
                        "desc": "Instead of resolving a template and data into a DOM chunk on the server, the template is compiled in the browser and only the data is transmitted from the server.", 
                        "analysis": "We see several JavaScript frameworks embrace browser-based templating, moving more layout work to the client. While this approach is useful in many cases, it does introduce operational issues involving caching, performance, and search. We believe these tools should be assessed carefully to ensure suitability for the target deployment environment."
                    },                    
                    {
                        "name": "Faraday",
                        "active": true, 
                        "desc": "A Ruby HTTP client library that provides a common interface over a variety of adapters and integrates nicely with Rack middleware.", 
                        "analysis": "Several ThoughtWorks teams called out the usefulness of Faraday."
                    },                    
                    {
                        "name": "Hystrix",
                        "active": true, 
                        "desc": "Hystrix is a latency and fault tolerance library designed to isolate points of access to remote systems, services and 3rd party libraries, stop cascading failure and enable resilience in complex distributed systems where failure is inevitable.", 
                        "analysis": "Managing dependencies in distributed systems can become complicated, and is a problem more people are facing with the move to finer-grained micro services. Hystrix is a library for the JVM from Netflix that implements patterns for dealing with downstream failure, offers real-time monitoring of connections, and caching and batching mechanisms to make inter-service dependencies more efficient."
                    },                    
                    {
                        "name": "Light Table",
                        "active": false, 
                        "desc": "Light Table is an integrated development environment for programming computer software with real time feedback allowing instant execution, debugging and access to documentation.", 
                        "analysis": ""
                    }                  
                ]
            },
            {
                "name": "Hold",
                "data": [
                    {
                        "name": "Heavyweight test tools",
                        "active": true, 
                        "desc": "N/A", 
                        "analysis": "Many organizations that have moved to more agile ways of working continue to use heavyweight testing tools. These tools have problems that make them unsuitable for fast moving software delivery. Large complex tools have high learning curves and require specialist skills and training, making it hard for the team themselves to test. Often this results in an unnecessary overhead for every release as other teams get involved. Expensive and limiting software licenses makes this problem even worse. Some heavyweight tools use a \"model driven\" approach where an attempt is made to accurately model the usage patterns of the application, which leads to costly test script maintenance and development time being lost to \"false positives.\" We have seen few situations where simple open source solutions cannot give the required level of confidence for much less time, effort and money."
                    },                    
                    {
                        "name": "Maven",
                        "active": false, 
                        "desc": "Maven is a build automation tool used primarily for Java projects. Maven addresses two aspects of building software: First, it describes how software is built, and second, it describes its dependencies.", 
                        "analysis": "Language-based build tools like Gradle and Rake continue to offer finer-grained abstractions and more flexibility long term than XML and plug-in based tools like Ant and Maven. This allows them to grow gracefully as projects become more complex."
                    },                    
                    {
                        "name": "TFS",
                        "active": true, 
                        "desc": "Team Foundation Server (commonly abbreviated to TFS) is a Microsoft product which provides for source code management (either via Team Foundation Version Control or Git), reporting, requirements management, project management (for both agile software development and waterfall teams), automated builds, lab management, testing and release management capabilities.", 
                        "analysis": "We continue to see teams run into productivity problems attempting to use TFS as a version control system. Teams that want to practice frequent code checkins, a core part of continuous integration, have found its heavyweight approach significantly drains productivity. This often leads to teams checking in less frequently, causing more problematic merges. We recommend tools such as Git, Perforce, and Subversion instead."
                    }                
                ]
            }
        ]
    },
    {
        "name": "Languages & Frameworks",
        "desc": "Specific languages, like JavaScript, and language specific frameworks, like Ember.",
        "layers": [
            {
                "name": "Adopt",
                "data": [
                    {
                        "name": "Clojure",
                        "active": false, 
                        "desc": "Clojure (pronounced like \"closure\") is a dialect of the Lisp programming language created by Rich Hickey. Clojure is a functional general-purpose language, and runs on the Java Virtual Machine, Common Language Runtime, and JavaScript engines.", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "CSS frameworks",
                        "active": true, 
                        "desc": "CSS frameworks simplify the development of large scale CSS codebases without having to start from scratch each time.", 
                        "analysis": "The abundance of frameworks, it is important to pick one that enables continued enhancement and maintenance of the codebase, rather than something that just helps you get started quickly. Frameworks based on mix-ins, such as Compass, or with a specific focus, such as Susy, are much better suited in this regard."
                    },                    
                    {
                        "name": "Jasmine paired with Node.js",
                        "active": false, 
                        "desc": "Jasmine is a behavior-driven development framework for testing JavaScript code. It does not depend on any other JavaScript frameworks. It does not require a DOM. And it has a clean, obvious syntax so that you can easily write tests.", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "Scala",
                        "active": false, 
                        "desc": "Scala (/ˈskɑːlə/ skah-lə) is an object-functional programming and scripting language for general software applications, statically typed, designed to concisely express solutions in an elegant, type-safe and lightweight (low ceremonial) manner.", 
                        "analysis": "N/A"
                    }
                ] 
            }, 
            {
                "name": "Trial",
                "data": [
                    {
                        "name": "CoffeeScript",
                        "active": true, 
                        "desc": "CoffeeScript is a programming language that transcompiles to JavaScript. The language adds syntactic sugar inspired by Ruby, Python and Haskell to enhance JavaScript's brevity and readability, adding additional features like list comprehension and pattern matching.", 
                        "analysis": "The expansion of single-page and mobile browser-based applications into mainstream use, along with continued growth of node.js for server-side applications, have led to increased adoption of CoffeeScript to simplify JavaScript codebases. As a language that compiles into JavaScript code for runtime execution, many concerns have been raised about the difficulty of debugging applications written in CoffeeScript. The introduction of Source Maps in CoffeeScript 1.6.1 is helping producers of development tools address this concern. We expect this will lead to further adoption of the language following the lead of highly visible technology firms such as Dropbox."
                    },                    
                    {
                        "name": "Dropwizard",
                        "active": false, 
                        "desc": "Dropwizard is a Java framework for developing ops-friendly, high-performance, RESTful web services.", 
                        "analysis": "N/A"
                    },                                       
                    {
                        "name": "JavaScript MV* frameworks",
                        "active": false, 
                        "desc": "N/A", 
                        "analysis": "Single-page web application development continues to flourish along with the frameworks supporting data binding, client-side templates, validation, and other capabilities. The JavaScript MV* frameworks in active use on ThoughtWorks projects include AngularJS,  Knockout, and Ember.js. Each has advocates and a few detractors. We expect continuing innovative churn in this vibrant space."
                    },                    
                    {
                        "name": "Play Framework 2",
                        "active": true, 
                        "desc": "Play is an open source web application framework, written in Scala and Java, which follows the model–view–controller (MVC) architectural pattern. It aims to optimize developer productivity by using convention over configuration, hot code reloading and display of errors in the browser.", 
                        "analysis": "The recent release of Play Framework 2.1.1 with support for controller dependency injection, asynchronous, non-blocking I/O, a code-reload workflow, database migrations, asset pipelining, and flexible deployment options has made it more attractive to developers. For this reason Play re-appears on the radar as something for teams to seriously consider when building web applications and services on the JVM. A word of caution however, Play embraces a functional programming style which, when working with the Java language, still translates into a plethora of static methods that may be difficult to unit test outside a running server."
                    },                    
                    {
                        "name": "Require.js & NPM",
                        "active": true, 
                        "desc": "Package management solutions and component repositories for JavaScript. Require.js specifically targets the browser environment while npm targets node.js applications.", 
                        "analysis": "Our continued use of node.js on new production applications has re-enforced our need for reliable packaging of JavaScript code and libraries. The Node Package Manager (npm) is an important part of the node.js ecosystem and a useful tool for packaging node.js applications. Developers of browser applications with large amounts of JavaScript or CoffeeScript should consider Require.js to help with structuring their code and loading dependencies at run time."
                    }  
                ]
            },
            {
                "name": "Assess",
                "data": [
                    {
                        "name": "Gremlin",
                        "active": false, 
                        "desc": "Gremlin is a domain-specific language based on Groovy that can be used to describe graph traversal.", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "Lua",
                        "active": false, 
                        "desc": "Lua is a lightweight multi-paradigm programming language designed as a scripting language with \"extensible semantics\" as a primary goal.", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "Nancy",
                        "active": true, 
                        "desc": "A lightweight web framework inspired by Sinatra for .Net", 
                        "analysis": "N/A"
                    },
                    {
                        "name": "RubyMotion",
                        "active": false, 
                        "desc": "RubyMotion is an implementation of the Ruby programming language that runs on iOS and OS X. RubyMotion is a commercial product created by Laurent Sansonetti for HipByte and is based on MacRuby for OS X.", 
                        "analysis": "N/A"
                    },                    
                    {
                        "name": "Twitter Bootstrap",
                        "active": false, 
                        "desc": "Bootstrap is a free collection of tools for creating websites and web applications. It contains HTML and CSS-based design templates for typography, forms, buttons, navigation and other interface components, as well as optional JavaScript extensions.", 
                        "analysis": "Twitter Bootstrap is a popular CSS framework which allows you to quickly produce a good looking website with fluid and responsive layouts. In this edition of the radar, Bootstrap moves back from Trial to Assess based on our experiences using it over time. If you wish to replace or extensively customize the look and feel of your application, Bootstrap can present a challenge due to its deep integration with HTML markup. This doesn’t necessarily make it a bad choice but it is worth keeping these limitations in mind when choosing it over available alternatives."
                    }            
                ]
            },
            {
                "name": "Hold",
                "data": [
                    {
                        "name": "Backbone.js",
                        "active": true, 
                        "desc": "Backbone.js is a JavaScript library with a RESTful JSON interface and is based on the model–view–presenter (MVP) application design paradigm. Backbone is known for being lightweight, as its only dependency is on one JavaScript library, Underscore.js. It is designed for developing single-page web applications, and for keeping various parts of web applications (e.g. multiple clients and the server) synchronized.", 
                        "analysis": "N/A"
                    },
                    {
                        "name": "Handwritten CSS",
                        "active": false, 
                        "desc": "Along with JavaScript and HTML, CSS is a core technology for creating websites. Unfortunately, the language itself lacks key features, which leads to a high level of duplication and a lack of meaningful abstractions.", 
                        "analysis": "While CSS3 aims to rectify some of these issues, it will be years before the modules that make up CSS3 will be properly supported in most browsers. Fortunately, there is a solution today using CSS frameworks like SASS, SCSS, and LESS. Due to their quality and support, we believe that the days of handwritten CSS, for anything apart from trivial work, are over."
                    }               
                ]
            }
        ]
    }
]